In [1]:
import pandas as pd
pd.set_option('display.max_columns', None)

import numpy as np

import warnings
warnings.filterwarnings('ignore')


import pylab as plt
import seaborn as sns


%matplotlib inline

In [2]:
old_hdd = pd.read_csv('data/old_HDD.csv')
actors = pd.read_csv('data/actor.csv')
category = pd.read_csv('data/category.csv')
film = pd.read_csv('data/film.csv')
inventory = pd.read_csv('data/inventory.csv')
language = pd.read_csv('data/language.csv')
rental = pd.read_csv('data/rental.csv')

In [3]:
# Viendo lo que me encuentro en la tabla, unifico las columnas de los nombres en una sola, y elimino last update, porque para mí no tiene relevancia

actorsname = actors.first_name + ' ' + actors.last_name

actors['name'] = actorsname

In [4]:
actors.head()

   actor_id first_name     last_name          last_update                 name
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33     PENELOPE GUINESS
1         2       NICK      WAHLBERG  2006-02-15 04:34:33        NICK WAHLBERG
2         3         ED         CHASE  2006-02-15 04:34:33             ED CHASE
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33       JENNIFER DAVIS
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33  JOHNNY LOLLOBRIGIDA

In [5]:
actors = actors.drop(columns=['first_name','last_name','last_update'])

In [6]:
actors.head()

   actor_id                 name
0         1     PENELOPE GUINESS
1         2        NICK WAHLBERG
2         3             ED CHASE
3         4       JENNIFER DAVIS
4         5  JOHNNY LOLLOBRIGIDA

In [7]:
#elimino la columna original_language_id porque sólo contiene valores nulos

film =  film.drop(columns= ['original_language_id', 'last_update'])

In [8]:
film.head()

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,6,2.99,130,22.99,G,Deleted Scenes

In [9]:
# Elimino la columna 'last_update'
category = category.drop(columns = ['last_update'])

In [10]:
category.head()

   category_id       name
0            1     Action
1            2  Animation
2            3   Children
3            4   Classics
4            5     Comedy

In [11]:
# Elimino la columna 'last_update' y 'store_id'

inventory = inventory.drop(columns = ['last_update', 'store_id'])

In [12]:
inventory.head()

   inventory_id  film_id
0             1        1
1             2        1
2             3        1
3             4        1
4             5        1

In [13]:
# Elimino las columnas 'last_update' y 'staff_id'
rental = rental.drop(columns = ['last_update', 'staff_id'])

In [14]:
rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21

In [15]:
# Elimino la columna 'last_update'

language = language.drop(columns=['last_update'])

In [16]:
language.head()

   language_id      name
0            1   English
1            2   Italian
2            3  Japanese
3            4  Mandarin
4            5    French

In [17]:
# Agrupo los nombres de los actores de old_hdd

actorsname = old_hdd.first_name + ' ' + old_hdd.last_name

old_hdd['name'] = actorsname

old_hdd.head()

,first_name,last_name,title,release_year,category_id,name
0,PENELOPE,GUINESS,ACADEMY DINOSAUR,2006,6,PENELOPE GUINESS
1,PENELOPE,GUINESS,ANACONDA CONFESSIONS,2006,2,PENELOPE GUINESS
2,PENELOPE,GUINESS,ANGELS LIFE,2006,13,PENELOPE GUINESS
3,PENELOPE,GUINESS,BULWORTH COMMANDMENTS,2006,10,PENELOPE GUINESS
4,PENELOPE,GUINESS,CHEAPER CLYDE,2006,14,PENELOPE GUINESS

In [18]:
# Elimino las columnas de nombre sobrantes

old_hdd = old_hdd.drop(columns= ['first_name', 'last_name'])

old_hdd.head()

                   title  release_year  category_id              name
0       ACADEMY DINOSAUR          2006            6  PENELOPE GUINESS
1   ANACONDA CONFESSIONS          2006            2  PENELOPE GUINESS
2            ANGELS LIFE          2006           13  PENELOPE GUINESS
3  BULWORTH COMMANDMENTS          2006           10  PENELOPE GUINESS
4          CHEAPER CLYDE          2006           14  PENELOPE GUINESS

In [19]:
# Asocio actor_id con el nombre de los actores

old_hdd = old_hdd.merge(actors, on= 'name', how= 'left' )

In [20]:
old_hdd.head()

,title,release_year,category_id,name,actor_id
0,ACADEMY DINOSAUR,2006,6,PENELOPE GUINESS,1
1,ANACONDA CONFESSIONS,2006,2,PENELOPE GUINESS,1
2,ANGELS LIFE,2006,13,PENELOPE GUINESS,1
3,BULWORTH COMMANDMENTS,2006,10,PENELOPE GUINESS,1
4,CHEAPER CLYDE,2006,14,PENELOPE GUINESS,1

In [21]:
# Ya no necesito la columna de nombre y la elimino

old_hdd = old_hdd.drop(columns=['name'])

In [22]:
old_hdd.head()

                   title  release_year  category_id  actor_id
0       ACADEMY DINOSAUR          2006            6         1
1   ANACONDA CONFESSIONS          2006            2         1
2            ANGELS LIFE          2006           13         1
3  BULWORTH COMMANDMENTS          2006           10         1
4          CHEAPER CLYDE          2006           14         1

In [23]:
# Hago lo mismo con film_id

old_hdd = old_hdd.merge(film, on= 'title', how= 'left')

In [24]:
old_hdd.head()

,title,release_year_x,category_id,actor_id,film_id,description,release_year_y,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,ACADEMY DINOSAUR,2006,6,1,1,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,ANACONDA CONFESSIONS,2006,2,1,23,A Lacklusture Display of a Dentist And a Denti...,2006,1,3,0.99,92,9.99,R,"Trailers,Deleted Scenes"
2,ANGELS LIFE,2006,13,1,25,A Thoughtful Display of a Woman And a Astronau...,2006,1,3,2.99,74,15.99,G,Trailers
3,BULWORTH COMMANDMENTS,2006,10,1,106,A Amazing Display of a Mad Cow And a Pioneer w...,2006,1,4,2.99,61,14.99,G,Trailers
4,CHEAPER CLYDE,2006,14,1,140,A Emotional Character Study of a Pioneer And a...,2006,1,6,0.99,87,23.99,G,"Trailers,Commentaries,Behind the Scenes"

In [25]:
# Elimino columnas que no necesito

old_hdd = old_hdd.drop(columns=['release_year_x','description','release_year_y','language_id', 'rental_duration', 'rental_rate','length', 'replacement_cost','rating', 'special_features'])

In [26]:
old_hdd.head()

                   title  category_id  actor_id  film_id
0       ACADEMY DINOSAUR            6         1        1
1   ANACONDA CONFESSIONS            2         1       23
2            ANGELS LIFE           13         1       25
3  BULWORTH COMMANDMENTS           10         1      106
4          CHEAPER CLYDE           14         1      140

In [27]:
film = film.merge(old_hdd, on='title', how= 'left')

In [28]:
film.head()

,film_id_x,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,category_id,actor_id,film_id_y
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",6.0,1.0,1.0
1,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",6.0,10.0,1.0
2,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",6.0,20.0,1.0
3,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",6.0,30.0,1.0
4,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",11.0,19.0,2.0

In [29]:
# Arreglo los duplicados

film = film.drop(columns= ['actor_id','film_id_y'])

In [30]:
# Le cambio el nombre a las columnas

film = film.rename(columns= {'film_id_x' : 'film_id'})

In [31]:
film.drop_duplicates(inplace=True)

In [32]:
film.shape

(1000, 12)

In [33]:
film.head()

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,category_id
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",6.0
4,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",11.0
5,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",6.0
8,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",NaN
9,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,6,2.99,130,22.99,G,Deleted Scenes,NaN

In [34]:
# Elimino todas las filas de rental, porque es de una base de datos antiguas, no tengo datos sobre los clientes y resulta innecesaria la información, pero viene genial para la contabilidad de la base de datos futura

rental.drop(rental.index, axis=0, inplace=True)

In [35]:
rental.head()

Empty DataFrame
Columns: [rental_id, rental_date, inventory_id, customer_id, return_date]
Index: []

In [36]:
# Elimino las columnas que me sobran del dataframe 'old_hdd'

old_hdd = old_hdd.drop(columns=['category_id','title'])

In [37]:
old_hdd.head()

   actor_id  film_id
0         1        1
1         1       23
2         1       25
3         1      106
4         1      140

In [38]:
# Creo las tablas que me faltan para la base de datos

leng = {'film_id': [], 'language_id' : []}

film_has_language = pd.DataFrame(leng)

In [39]:
# Conexión entre film y language

film_has_language.head()

Empty DataFrame
Columns: [film_id, language_id]
Index: []

In [40]:
# Customer

cust = {'customer_id' : [], 'name' : [], 'email' : [], 'zip' : [], 'rental_history' : [], 'age' : []}

customer = pd.DataFrame(cust)

In [41]:
customer.head()

Empty DataFrame
Columns: [customer_id, name, email, zip, rental_history, age]
Index: []

In [42]:
# Conexión entre rental y customer

rent = {'rental_id' : [], 'customer_id' : []}

rental_has_customer = pd.DataFrame(rent)

In [43]:
rental_has_customer.head()

Empty DataFrame
Columns: [rental_id, customer_id]
Index: []

In [45]:
# Staff

st = {'staff_id' : [], 'name' : [], 'tlf' : [], 'adress' : [], 'ss_number' : [], 'bank_data' : []}

staff = pd.DataFrame(st)

In [46]:
staff.head()

Empty DataFrame
Columns: [staff_id, name, tlf, adress, ss_number, bank_data]
Index: []

In [47]:
# Store

stre = {'store_id' : [], 'rent' : [], 'employee_salary' : [], 'staff_id' : [] , 'maintenance' : [], 'insurance' : [], 'commercials' : [], 'purchase' : [], 'tech' : [], 'taxes' : [], 'inventory_id' : []}

store = pd.DataFrame(stre)

In [48]:
store.head()

Empty DataFrame
Columns: [store_id, rent, employee_salary, staff_id, maintenance, insurance, commercials, purchase, tech, taxes, inventory_id]
Index: []

In [61]:
rental_has_customer.head()

Empty DataFrame
Columns: [rental_id, customer_id]
Index: []

In [62]:
from sqlalchemy import create_engine

str_conn = 'mysql+pymysql://root:c0030dab8@localhost:3306'
cursor = create_engine(str_conn)

cursor.execute('drop database if exists blockbuster;')
cursor.execute('create database blockbuster;')

In [63]:
str_conn = 'mysql+pymysql://root:c0030dab8@localhost:3306/blockbuster'
cursor = create_engine(str_conn)

In [64]:
old_hdd.to_sql(name='old_hdd', con=cursor, if_exists='replace', index=False)

1000

In [65]:
actors.to_sql(name='actors', con=cursor, if_exists='replace', index=False)

200

In [66]:
category.to_sql(name='category', con=cursor, if_exists='replace', index=False)

16

In [67]:
film.to_sql(name='film', con=cursor, if_exists='replace', index=False)

1000

In [68]:
language.to_sql(name='language', con=cursor, if_exists='replace', index=False)

6

In [69]:
inventory.to_sql(name='inventory', con=cursor, if_exists='replace', index=False)

1000

In [70]:
rental.to_sql(name='rental', con=cursor, if_exists='replace', index=False)

0

In [71]:
store.to_sql(name='store', con=cursor, if_exists='replace', index=False)

0

In [72]:
customer.to_sql(name='customer', con=cursor, if_exists='replace', index=False)

0

In [73]:
staff.to_sql(name='staff', con=cursor, if_exists='replace', index=False)

0

In [74]:
film_has_language.to_sql(name='film_has_language', con=cursor, if_exists='replace', index=False)

0

In [75]:
rental_has_customer.to_sql(name='rental_has_customer', con=cursor, if_exists='replace', index=False)

0